#include <stdio.h>

int main() {

double x = 1.0 , y = 2.0 ; // กำหนดตัวแปร x = 1.0, y = 2.0

printf("x = %.1f, y = %.1f\n", x, y); // แสดงผลตัวแปร x และ y

printf("x = y + 5.0 :            x = %.1f, y = %.1f\n", x = y + 5.0, y); // แสดงผลตัวแปร x ที่เป็นผลบวกของ y กับ 5.0

printf("y = x / 2.0 :            x = %.1f, y = %.1f\n", x, y = x / 2.0); // แสดงผลตัวแปร y ที่เป็นผลหารของ x ด้วย 2.0

printf("y = (x * 3.0) + 4.0 :    x = %.1f, y = %.1f\n", x, y = x * 3.0 + 4.0); // แสดงผลการคูณ x กับ 3.0 แล้วบวก 4.0

printf("x = -0.5 - y :           x = %.1f, y = %.1f\n", x = -0.5 - y, y); // แสดงผลการลบ 0.5 กับ y แล้วเก็บใน x

printf("z = x + y :              x = %.1f, y = %.1f, z = %.1f\n", x, y, x + y); // แสดงผลการบวก x กับ y
}