#include <stdio.h>

int main() {

int i = 1 , j = 2 , k ;// กำหนดตัวแปร i = 1, j = 2

printf("i = %d, j = %d, k\n", i, j); // แสดงผลตัวแปร i และ j

printf("k = i + j :            i = %d, j = %d, k = %d\n", i, j, k=i+j); // แสดงผลตัวแปร i, j และ k ที่เป็นผลรวมของ i และ j

printf("i = i + (k * j) :      i = %d, j = %d, k = %d\n", i=i+(k*j), j, k=i+j); // แสดงผลตัวแปร i, j และ k ที่เป็นผลรวมของ i กับผลคูณของ k และ j

printf("j = i / 2 :            i = %d, j = %d, k = %d\n", i, j=i/2, k); // แสดงผลตัวแปร i, j ที่เป็นผลหารของ i ด้วย 2 และ k ยังคงเป็นผลรวมก่อนหน้านี้

printf("k = i %% 2 :            i = %d, j = %d, k = %d\n", i, j, k=i%2); // แสดงผลตัวแปร i, j และ k ที่เป็นเศษของ i เมื่อหารด้วย 2

printf("i = (j + k) * 3 :      i = %d, j = %d, k = %d\n", i=(j+k)*3, j, k); // แสดงผลตัวแปร i ที่เป็นผลคูณของผลรวมของ j และ k กับ 3

return 0; // คืนค่า 0 เพื่อบ่งบอกว่าโปรแกรมทำงานสำเร็จ
}